hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
#define PWR_GPIO                            GPIOB
#define PWR_PINMASK                         BIT(15)
#define PWR_PINMODE                         GPIO_MODE_PUSHPULL

#define RB_GPIO                             GPIOD
#define RB_PINMASK                          BIT(15)
#define RB_PINMODE                          GPIO_MODE_INPUT
///@}


/**
 *  @brief  The pins below are be controlled by EBI
 *
 *  @note
 *     | Signal | EBI signal |  Port pin   |  Description                 |
 *     |--------|----------- |-------------|------------------------------|
 *     | IO0-7  |  AD00-07   | PE8-15      |  Address/Data pins           |
 *     | ALE    |  A24       |   PC1       |  Address Latch Enable        |
 *     | CLE    |  A25       |   PC2       |  Command Latch Enable        |
 *     | WE     |  WEn       |   PF8       |  Write enable                |
 *     | RE     |  REn       |   PF9       |  Read enable                 |
 *
 *  @note  NAND_WE and NAND_RE are not used. WEn and REn are used instead!!
 *  @note  PF8 is only used as WE when LOCATION is configured as LOC1
 */
///@{
#define AD_GPIO                             GPIOE
#define AD_PINMASK                          ( BIT(15)|BIT(14)|BIT(13)|BIT(12) \
                                             |BIT(11)|BIT(10)|BIT(9)|BIT(8)   \
                                            )

#define ALE_GPIO                            GPIOC
#define ALE_PINMASK                         BIT(1)

#define CLE_GPIO                            GPIOC
#define CLE_PINMASK                         BIT(2)

#define WE_GPIO                             GPIOF
#define WE_PINMASK                          BIT(8)

#define RE_GPIO                             GPIOF
#define RE_PINMASK                          BIT(9)
///@}


/// Setting timing parameters (unit is HFPERCLK period)
///@{
#define NANO_DELAY                         (20)
#define ADDR_SETUPTIME                      (0)
#define ADDR_HOLDTIME                       (0)
#define RD_SETUPTIME                        (0)
#define RD_HOLDTIME                         (1)
#define RD_STROBETIME                       (2)
#define WR_SETUPTIME                        (0)
#define WR_HOLDTIME                         (1)
#define WR_STROBETIME                       (2)
///@}


/**
 *  @brief  NAND Command Table
 *
 *  @note   It handles the address too.
 *  @note   There are two form of addresses to be sent.
 *          * 4 bytes (32 bit) address for read/program page
 *          * 3 bytes (24 bit) address for block erase
 *
 *  @note   There are two place holders in the table.
 *          * FULLADDRESS
 *          * SHORTADDRESS
 *          They shows how to send the address. The short address
 *          is used to address a block. Important note: The A8
 *          bit is not sent, because the command used already informs
 *          its value. *Read A* means A8=0, *Read B* means A8=1. For
 *          *Read C* it is a don't care.
 *
 *  @note   They must be set to values not used by the NAND Flash
 *          as command
 *
 *  @note   Command table used as parameter to send command
 *
 *  @note   These are the indexes for the table below
 *
 *  @note   Maybe a enum is a better idea
 */
#define CMD_READA                               0
#define CMD_READB                               1
#define CMD_READC                               2
#define CMD_READSIGNATURE                       3
#define CMD_READSTATUS                          4
#define CMD_PROGRAMA                            5
#define CMD_PROGRAMB                            6
#define CMD_PROGRAMC                            7
#define CMD_COPYBACK1                           8
#define CMD_COPYBACK2                           9
#define CMD_ERASEBLOCK                         10
#define CMD_RESET                              11
#define CMD_CONFIRM                            12

///@{
/*
 *  @note  These symbols are used as place holders.
 *         They must be different from the any code used by the DEVICE
 */
#define FULLADDRESS                          (0xFA)
#define SHORTADDRESS                         (0x5A)
///@}

typedef struct {
    uint8_t     n;
    uint8_t    *v;
} Command_TypeDef;


/// NAND Flash commands table
const Command_TypeDef CommandList[] = {
    {   2, (uint8_t []) {0x00, FULLADDRESS } },          //  0: Read A
    {   2, (uint8_t []) {0x01, FULLADDRESS } },          //  1: Read B
    {   2, (uint8_t []) {0x50, FULLADDRESS } },          //  2: Read C/Spare
    {   1, (uint8_t []) {0x90} },                        //  3: Read Signature
    {   1, (uint8_t []) {0x70} },                        //  4 Read Status
    {   3, (uint8_t []) {0x00, 0x80, FULLADDRESS} },     //  5: Program A
    {   3, (uint8_t []) {0x01, 0x80, FULLADDRESS} },     //  6: Program B
    {   3, (uint8_t []) {0x50, 0x80, FULLADDRESS} },     //  7: Program C
    {   3, (uint8_t []) {0x00, FULLADDRESS, 0x8A} },     //  8: Copy back 1
    {   2, (uint8_t []) {FULLADDRESS, 0x10} },           //  9: Copy back 2
    {   3, (uint8_t []) {0x60, SHORTADDRESS, 0xD0} },    // 10: Erase block
    {   1, (uint8_t []) {0xFF} },                        // 11: Reset
    {   1, (uint8_t []) {0x10} }                         // 12: Confirm
};

///@}


/**
 *  @brief  Signature
 */
///@{
#define MFG_CODE                            0x20
#define DEV_CODE                            0x75


///@}
/**
 * @brief  Adresses used to access NAND Flash
 */
///@{
static  uint8_t *const pntData     = (uint8_t *) 0x80000000;
static  uint8_t *const pntAddress  = (uint8_t *) 0x81000000;
static  uint8_t *const pntCommand  = (uint8_t *) 0x82000000;
// To make it easier to write to or read from NAND Flash
#define NAND_DATA       *pntData
#define NAND_ADDRESS    *pntAddress
#define NAND_COMMAND    *pntCommand
///@}

//static uint8_t spare[NAND_SPARESIZE];

/*
 *  @brief  Nano delay
 */
void nano_delay(uint32_t n) {
    while(n--) {
        __NOP();
    }
}

/*********************** Command routine **************************************/

/**
 *  @brief  Send Command
 */
static int32_t
SendCommand(int32_t cmd, uint32_t address) {
    for(int32_t i=0;i<CommandList[cmd].n;i++) {
        uint8_t command =  CommandList[cmd].v[i];
        if( command == FULLADDRESS ) {
            NAND_ADDRESS = address&0xFF;
            address >>= 9;   // No A8
            NAND_ADDRESS = address&0xFF;
            address >>= 8;
            NAND_ADDRESS = address&0xFF;
            // Only for 512 MB and 1 GB devices
            // address >>= 8;
            // NAND_ADDRESS = address&0xFF;
        } else if ( command == SHORTADDRESS ) {
            address >>= 9;
            NAND_ADDRESS = address&0xFF;
            address >>= 8;
            NAND_ADDRESS = address&0xFF;
            // Only for 512 MB and 1 GB devices
            // address >>= 8;
            // NAND_ADDRESS = address&0xFF;
        } else {
            NAND_COMMAND = command;
        }

