hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
#define PARITYBYTETABLE


#ifdef PARITYBYTETABLE
/*
 *  @note   Only bit 0 is used for paritytable8
 */

/*********************** Status routines **************************************/

static uint8_t paritytable8[] __attribute__((unused)) = {
    0,   // 0b00000000 = 0x00
    1,   // 0b00000001 = 0x01
    1,   // 0b00000010 = 0x02
    0,   // 0b00000011 = 0x03
    1,   // 0b00000100 = 0x04
    0,   // 0b00000101 = 0x05
    0,   // 0b00000110 = 0x06
    1,   // 0b00000111 = 0x07
    1,   // 0b00001000 = 0x08
    0,   // 0b00001001 = 0x09
    0,   // 0b00001010 = 0x0A
    1,   // 0b00001011 = 0x0B
    0,   // 0b00001100 = 0x0C
    1,   // 0b00001101 = 0x0D
    1,   // 0b00001110 = 0x0E
    0,   // 0b00001111 = 0x0F
    1,   // 0b00010000 = 0x10
    0,   // 0b00010001 = 0x11
    0,   // 0b00010010 = 0x12
    1,   // 0b00010011 = 0x13
    0,   // 0b00010100 = 0x14
    1,   // 0b00010101 = 0x15
    1,   // 0b00010110 = 0x16
    0,   // 0b00010111 = 0x17
    0,   // 0b00011000 = 0x18
    1,   // 0b00011001 = 0x19
    1,   // 0b00011010 = 0x1A
    0,   // 0b00011011 = 0x1B
    1,   // 0b00011100 = 0x1C
    0,   // 0b00011101 = 0x1D
    0,   // 0b00011110 = 0x1E
    1,   // 0b00011111 = 0x1F
    1,   // 0b00100000 = 0x20
    0,   // 0b00100001 = 0x21
    0,   // 0b00100010 = 0x22
    1,   // 0b00100011 = 0x23
    0,   // 0b00100100 = 0x24
    1,   // 0b00100101 = 0x25
    1,   // 0b00100110 = 0x26
    0,   // 0b00100111 = 0x27
    0,   // 0b00101000 = 0x28
    1,   // 0b00101001 = 0x29
    1,   // 0b00101010 = 0x2A
    0,   // 0b00101011 = 0x2B
    1,   // 0b00101100 = 0x2C
    0,   // 0b00101101 = 0x2D
    0,   // 0b00101110 = 0x2E
    1,   // 0b00101111 = 0x2F
    0,   // 0b00110000 = 0x30
    1,   // 0b00110001 = 0x31
    1,   // 0b00110010 = 0x32
    0,   // 0b00110011 = 0x33
    1,   // 0b00110100 = 0x34
    0,   // 0b00110101 = 0x35
    0,   // 0b00110110 = 0x36
    1,   // 0b00110111 = 0x37
    1,   // 0b00111000 = 0x38
    0,   // 0b00111001 = 0x39
    0,   // 0b00111010 = 0x3A
    1,   // 0b00111011 = 0x3B
    0,   // 0b00111100 = 0x3C
    1,   // 0b00111101 = 0x3D
    1,   // 0b00111110 = 0x3E
    0,   // 0b00111111 = 0x3F
    1,   // 0b01000000 = 0x40
    0,   // 0b01000001 = 0x41
    0,   // 0b01000010 = 0x42
    1,   // 0b01000011 = 0x43
    0,   // 0b01000100 = 0x44
    1,   // 0b01000101 = 0x45
    1,   // 0b01000110 = 0x46
    0,   // 0b01000111 = 0x47
    0,   // 0b01001000 = 0x48
    1,   // 0b01001001 = 0x49
    1,   // 0b01001010 = 0x4A
    0,   // 0b01001011 = 0x4B
    1,   // 0b01001100 = 0x4C
    0,   // 0b01001101 = 0x4D
    0,   // 0b01001110 = 0x4E
    1,   // 0b01001111 = 0x4F
    0,   // 0b01010000 = 0x50
    1,   // 0b01010001 = 0x51
    1,   // 0b01010010 = 0x52
    0,   // 0b01010011 = 0x53
    1,   // 0b01010100 = 0x54
    0,   // 0b01010101 = 0x55
    0,   // 0b01010110 = 0x56
    1,   // 0b01010111 = 0x57
    1,   // 0b01011000 = 0x58
    0,   // 0b01011001 = 0x59
    0,   // 0b01011010 = 0x5A
    1,   // 0b01011011 = 0x5B
    0,   // 0b01011100 = 0x5C
    1,   // 0b01011101 = 0x5D
    1,   // 0b01011110 = 0x5E
    0,   // 0b01011111 = 0x5F
    0,   // 0b01100000 = 0x60
    1,   // 0b01100001 = 0x61
    1,   // 0b01100010 = 0x62
    0,   // 0b01100011 = 0x63
    1,   // 0b01100100 = 0x64
    0,   // 0b01100101 = 0x65
    0,   // 0b01100110 = 0x66
    1,   // 0b01100111 = 0x67
    1,   // 0b01101000 = 0x68
    0,   // 0b01101001 = 0x69
    0,   // 0b01101010 = 0x6A
    1,   // 0b01101011 = 0x6B
    0,   // 0b01101100 = 0x6C
    1,   // 0b01101101 = 0x6D
    1,   // 0b01101110 = 0x6E
    0,   // 0b01101111 = 0x6F
    1,   // 0b01110000 = 0x70
    0,   // 0b01110001 = 0x71
    0,   // 0b01110010 = 0x72
    1,   // 0b01110011 = 0x73
    0,   // 0b01110100 = 0x74
    1,   // 0b01110101 = 0x75
    1,   // 0b01110110 = 0x76
    0,   // 0b01110111 = 0x77
    0,   // 0b01111000 = 0x78
    1,   // 0b01111001 = 0x79
    1,   // 0b01111010 = 0x7A
    0,   // 0b01111011 = 0x7B
    1,   // 0b01111100 = 0x7C
    0,   // 0b01111101 = 0x7D
    0,   // 0b01111110 = 0x7E
    1,   // 0b01111111 = 0x7F
    1,   // 0b10000000 = 0x80
    0,   // 0b10000001 = 0x81
    0,   // 0b10000010 = 0x82
    1,   // 0b10000011 = 0x83
    0,   // 0b10000100 = 0x84
    1,   // 0b10000101 = 0x85
    1,   // 0b10000110 = 0x86
    0,   // 0b10000111 = 0x87
    0,   // 0b10001000 = 0x88
    1,   // 0b10001001 = 0x89
    1,   // 0b10001010 = 0x8A
    0,   // 0b10001011 = 0x8B
    1,   // 0b10001100 = 0x8C
    0,   // 0b10001101 = 0x8D
    0,   // 0b10001110 = 0x8E
    1,   // 0b10001111 = 0x8F
    0,   // 0b10010000 = 0x90
    1,   // 0b10010001 = 0x91
    1,   // 0b10010010 = 0x92
    0,   // 0b10010011 = 0x93
    1,   // 0b10010100 = 0x94
    0,   // 0b10010101 = 0x95
    0,   // 0b10010110 = 0x96
    1,   // 0b10010111 = 0x97
    1,   // 0b10011000 = 0x98
    0,   // 0b10011001 = 0x99
    0,   // 0b10011010 = 0x9A
    1,   // 0b10011011 = 0x9B
    0,   // 0b10011100 = 0x9C
    1,   // 0b10011101 = 0x9D
    1,   // 0b10011110 = 0x9E
    0,   // 0b10011111 = 0x9F
    0,   // 0b10100000 = 0xA0
    1,   // 0b10100001 = 0xA1
    1,   // 0b10100010 = 0xA2
    0,   // 0b10100011 = 0xA3
    1,   // 0b10100100 = 0xA4
    0,   // 0b10100101 = 0xA5
    0,   // 0b10100110 = 0xA6
    1,   // 0b10100111 = 0xA7
    1,   // 0b10101000 = 0xA8
    0,   // 0b10101001 = 0xA9
    0,   // 0b10101010 = 0xAA
    1,   // 0b10101011 = 0xAB
    0,   // 0b10101100 = 0xAC
    1,   // 0b10101101 = 0xAD
    1,   // 0b10101110 = 0xAE
    0,   // 0b10101111 = 0xAF
    1,   // 0b10110000 = 0xB0
    0,   // 0b10110001 = 0xB1
    0,   // 0b10110010 = 0xB2
    1,   // 0b10110011 = 0xB3
    0,   // 0b10110100 = 0xB4
    1,   // 0b10110101 = 0xB5
    1,   // 0b10110110 = 0xB6
    0,   // 0b10110111 = 0xB7
    0,   // 0b10111000 = 0xB8
    1,   // 0b10111001 = 0xB9
    1,   // 0b10111010 = 0xBA
    0,   // 0b10111011 = 0xBB
    1,   // 0b10111100 = 0xBC
    0,   // 0b10111101 = 0xBD
    0,   // 0b10111110 = 0xBE
    1,   // 0b10111111 = 0xBF
    0,   // 0b11000000 = 0xC0
    1,   // 0b11000001 = 0xC1
    1,   // 0b11000010 = 0xC2
    0,   // 0b11000011 = 0xC3
    1,   // 0b11000100 = 0xC4
    0,   // 0b11000101 = 0xC5
    0,   // 0b11000110 = 0xC6
    1,   // 0b11000111 = 0xC7
    1,   // 0b11001000 = 0xC8
    0,   // 0b11001001 = 0xC9
    0,   // 0b11001010 = 0xCA
    1,   // 0b11001011 = 0xCB
    0,   // 0b11001100 = 0xCC
    1,   // 0b11001101 = 0xCD
    1,   // 0b11001110 = 0xCE
    0,   // 0b11001111 = 0xCF
    1,   // 0b11010000 = 0xD0
    0,   // 0b11010001 = 0xD1
    0,   // 0b11010010 = 0xD2
    1,   // 0b11010011 = 0xD3
    0,   // 0b11010100 = 0xD4
    1,   // 0b11010101 = 0xD5
    1,   // 0b11010110 = 0xD6
    0,   // 0b11010111 = 0xD7
    0,   // 0b11011000 = 0xD8
    1,   // 0b11011001 = 0xD9
    1,   // 0b11011010 = 0xDA
    0,   // 0b11011011 = 0xDB
    1,   // 0b11011100 = 0xDC
    0,   // 0b11011101 = 0xDD
    0,   // 0b11011110 = 0xDE
    1,   // 0b11011111 = 0xDF
    1,   // 0b11100000 = 0xE0
    0,   // 0b11100001 = 0xE1
    0,   // 0b11100010 = 0xE2
    1,   // 0b11100011 = 0xE3
    0,   // 0b11100100 = 0xE4
    1,   // 0b11100101 = 0xE5
    1,   // 0b11100110 = 0xE6
    0,   // 0b11100111 = 0xE7
    0,   // 0b11101000 = 0xE8
    1,   // 0b11101001 = 0xE9
    1,   // 0b11101010 = 0xEA
    0,   // 0b11101011 = 0xEB
    1,   // 0b11101100 = 0xEC
    0,   // 0b11101101 = 0xED
    0,   // 0b11101110 = 0xEE
    1,   // 0b11101111 = 0xEF
    0,   // 0b11110000 = 0xF0
    1,   // 0b11110001 = 0xF1
    1,   // 0b11110010 = 0xF2
    0,   // 0b11110011 = 0xF3
    1,   // 0b11110100 = 0xF4
    0,   // 0b11110101 = 0xF5
    0,   // 0b11110110 = 0xF6
    1,   // 0b11110111 = 0xF7
    1,   // 0b11111000 = 0xF8
    0,   // 0b11111001 = 0xF9
    0,   // 0b11111010 = 0xFA
    1,   // 0b11111011 = 0xFB
    0,   // 0b11111100 = 0xFC
    1,   // 0b11111101 = 0xFD
    1,   // 0b11111110 = 0xFE
    0,   // 0b11111111 = 0xFF
};

#define PARITY(X) paritytable8[(uint8_t) X]

#else // PARITYBYTETABLE
/**
 *  @note  All 32 bits are used. The index 0 corresponds to the highest bit
 */
static uint32_t paritytable32[] = {
    0b10010110011010010110100110010110,   // 0x00 -> 0x1F
    0b01101001100101101001011001101001,   // 0x20 -> 0x3F
    0b01101001100101101001011001101001,   // 0x40 -> 0x5F
    0b10010110011010010110100110010110,   // 0x60 -> 0x7F
    0b01101001100101101001011001101001,   // 0x80 -> 0x9F
    0b10010110011010010110100110010110,   // 0xA0 -> 0xBF
    0b10010110011010010110100110010110,   // 0xC0 -> 0xDF
    0b01101001100101101001011001101001,   // 0xE0 -> 0xFF
};

#define PARITY(X) (paritytable32[(uint8_t) ((X)>>5)]&(0x8000000>>((X)&0x1F)

#endif // PARITYBYTETABLE

static int  h2d_encode( uint8_t *data, uint32_t *pecc) {
const uint8_t maskq1  = 0x55;  // 0x0x0x0x: Only odd bits
const uint8_t maskp1  = 0xAA;  // x0x0x0x0: Only even bits
const uint8_t maskq2  = 0x33;  // 00xx00xx: Bits 5,4,1,0
const uint8_t maskp2  = 0xCC;  // xx00xx00: Bits 7,6,3,2
const uint8_t maskq4  = 0x0F;  // 00xx00xx: Bits 3,2,1,0
const uint8_t maskp4  = 0xF0;  // 00xx00xx: Bits 7,6,5,4
uint8_t p1=0,q1=0,p2=0,q2=0,p4=0,q4=0;
uint8_t p = 0;
uint32_t wp = 0; // parity word

    // Iterate over all values in page
    for(int i=0;i<512;i++) {
        uint8_t v = data[i];
        //printf("%3d -> %02X\n",i,(unsigned) v);
        p ^= v;
        if( PARITY(v) ) {
            // Address has 9 bits = 2^9 = 512
            //                 Pn        Qn = Pn'
            wp ^= ((i&1)   ? BIT(7)  : BIT(6));       //  P8/Q8
            wp ^= ((i&2)   ? BIT(9)  : BIT(8));       //  P16/Q16
            wp ^= ((i&4)   ? BIT(11) : BIT(10));      //  P32/Q32
            wp ^= ((i&8)   ? BIT(13) : BIT(12));      //  P64/Q64
            wp ^= ((i&16)  ? BIT(15) : BIT(14));      //  P128/Q128
            wp ^= ((i&32)  ? BIT(17) : BIT(16));      //  P256/Q256
            wp ^= ((i&64)  ? BIT(19) : BIT(18));      //  P512/Q512
            wp ^= ((i&128) ? BIT(21) : BIT(20));      //  P1024/Q1024
            wp ^= ((i&256) ? BIT(23) : BIT(22));      //  P2048/Q2048
        }
    }
    q1 = PARITY(p&maskq1);
    p1 = PARITY(p&maskp1);
    q2 = PARITY(p&maskq2);
    p2 = PARITY(p&maskp2);
    q4 = PARITY(p&maskq4);
    p4 = PARITY(p&maskp4);
    wp |= (p4<<5)| (q4<<4)| (p2<<3)| (q2<<2)| (p1<<1)| (q1<<0);

