hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
    *pecc = wp;
    return 0;
}

/**
 *  @brief  Verify ECC
 *
 *  @note    There are four cases to be handled.
 *
 *  | Case        |  ECC Result                                                |
 *  |-------------|------------------------------------------------------------|
 *  | No Error    | Syndrome has all valid Pn, Pn'. Pn = Pn' = 0               |
 *  | 1-bit Error | For all valid syndrome (Pn, Pn') pairs, Pn = not(Pn')      |
 *  | ECC Error   | Syndrome has only 1 bit set. Error is in the ECC itself    |
 *  | Hard Error  | Other cases. Multiple (2 or more) bits are incorrect.      |
 *
 *  @note  When there is an 1-bin error, it can be corrected.
 *
 *  @note  For 8-bit wide data the position of the incorrect bit is  indicated
 *         by bit pattern (P4, P2, P1); the position of the incorrect byte is
 *         indicated by (..., P32, P16, P8).
 *
 *  @note  For 16-bit wide  data the position of the incorrect bit  is
 *         (P8, P4, P2, P1); the incorrect byte number is indicated by
 *         (..., P64, P32, P16)
 *
 *  @note  In case of ECC error (1 bit set), there is no error in the data.
 *
 *  @note  All other results imply a multiple error without the possibility of
 *         correction.
 *
 *  @return
 *         0: No error
 *         1: 1-bit error. Parameters pos and bit shows where the error occurs
 *         2: Error in checksum
 *        -1: Errors in multiple bits
 */


static int h2d_verify( uint32_t wp1, uint32_t wp2, uint16_t *ppos, uint8_t *pbit) {

    // Calculate syndrome = XOR of parity words
    uint32_t syndrome = wp1^wp2;

    //printf("Syndrome = %06X (=%024b)\n",syndrome,syndrome);

    // If syndrome is all zero, no error
    if( syndrome == 0 ) {
        return 0;
    }

    // When only one bit set, there is an error in the ECC field
    if( ispower2(syndrome) ) {
        return 2;
    }

    // For all valid (?) syndrome (Pn,Qn) pairs
    // if Pn = !Qn, there is 1-bit error
    //
    uint32_t ps = syndrome&0xAAAAAA; // even bits
    uint32_t qs = syndrome&0x555555; // odd bits
    uint32_t e = ((ps)^(qs<<1))^0xAAAAAA;

    if( e != 0 ) {
        return -1;
    }

    uint32_t w = ps;
    int bit   =  ((w&BIT(1))?1:0x0)
                |((w&BIT(3))?2:0x0)
                |((w&BIT(5))?4:0x0);
    int pos   =  ((w&BIT(7))?1:0x0)
                |((w&BIT(9))?2:0x0)
                |((w&BIT(11))?0x4:0x0)
                |((w&BIT(13))?0x8:0x0)
                |((w&BIT(15))?0x10:0x0)
                |((w&BIT(17))?0x20:0x0)
                |((w&BIT(19))?0x40:0x0)
                |((w&BIT(21))?0x80:0x0)
                |((w&BIT(23))?0x100:0x0);

    // one error detected. It can be corrected
    *ppos = pos;
    *pbit = bit;

    return 1;
}


/*********************** Status routines **************************************/

/**
 *  @brief  Return status from device using command status
 */
uint32_t NAND_Status(void) {
uint8_t status;

    EnableCE();
    SendCommand(CMD_READSTATUS,0);
    status = NAND_DATA;
    DisableCE();

    return status&NAND_STATUS_ALL;
}

/**
 *  @brief  Wait until Ready/Busy bit in Status Register indicates Ready
 *
 *  @note   Bit R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when error!
 */
int32_t  NAND_WaitUntilReadyStatus(void) {

    nano_delay(NANO_DELAY);
    uint32_t timeout = NAND_TIMEOUT;
    do {
        NAND_COMMAND = CommandList[CMD_READSTATUS].v[0];
    } while ( --timeout && (NAND_DATA&NAND_STATUS_READY) );
    return NAND_DATA&NAND_STATUS_READY;
}

/**
 *  @brief  Check if Ready using Status Register
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when Busy
 */
int32_t  NAND_CheckReadyStatus(void) {

    nano_delay(NANO_DELAY);
    NAND_COMMAND = CommandList[CMD_READSTATUS].v[0];
    return NAND_DATA&NAND_STATUS_READY;
}

///@{
/**
 * @brief  Ready/Busy functions
 *
 * @note
 */

int32_t  NAND_Ready(void) {

    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK)!=0;
}

int32_t  NAND_Busy(void) {

    return !NAND_Ready();
}

/**
 *  @brief  Wait until Ready/Busy Pin indicates Ready
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when error!
 */
int32_t  NAND_WaitUntilReadyPin(void) {

    nano_delay(NANO_DELAY);
    uint32_t timeout = NAND_TIMEOUT;
    while ( --timeout && ( (GPIO_ReadPins(RB_GPIO)&RB_PINMASK)==0) )
        {}
    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK);
}

/**
 *  @brief  Check if Ready using R/B# pin
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when Busy
 */
int32_t  NAND_CheckReadyPin(void) {

    nano_delay(NANO_DELAY);
    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK);
}
///@}

/*********************** Copy routines ****************************************/

/**
 *  @brief  Copy data from memory to Flash device
 *
 *  @note   Preparation to use DMA
 */
static int32_t CopyToFlash(uint8_t *data, uint16_t n) {

    for(uint16_t i=0;i<n;i++) {
        NAND_DATA = data[i];
    }
    return 0;
}

/**
 *  @brief  Copy data from Flash device into memory
 *
 *  @note   Preparation to use DMA
 */
static int32_t CopyFromFlash(uint8_t *data, uint16_t n) {

    for(uint16_t i=0;i<n;i++) {
        data[i] = NAND_DATA;
    }
    return 0;
}

/**
 *  @brief  Copy data from Flash device to memory (ECC version)
 *
 *  @note   Prepared to use DMA
 */
static int32_t CopyFromFlashECC(uint8_t *data, uint16_t n, uint32_t *pchksum) {

    if( n != NAND_PAGESIZE ) // Must be 512!!!
        return -1;

    // read Areas A and B (page area)
    EBI->CMD = EBI_CMD_ECCCLEAR;
    EBI->CMD = EBI_CMD_ECCSTART;
    for(uint16_t i=0;i<NAND_PAGESIZE;i++) {
        data[i] = NAND_DATA;
    }
    EBI->CMD = EBI_CMD_ECCSTOP;
    *pchksum = EBI->ECCPARITY;

    // Read area C (spare area)
    for(uint16_t i=0;i<NAND_SPARESIZE;i++) {
        data[NAND_PAGESIZE+i] = NAND_DATA;
    }
    return 0;
}

/**
 *  @brief  Copy data from memory to Flash device ECC (ECC version)
 *
 *  @note   Prepared to use DMA
 */
static int32_t CopyToFlashECC(uint8_t *data, uint16_t n) {

