hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
    if( n != NAND_PAGESIZE ) // Must be 512!!!!
        return -1;

    EBI->CMD = EBI_CMD_ECCCLEAR;
    EBI->CMD = EBI_CMD_ECCSTART;
    for(uint16_t i=0;i<NAND_PAGESIZE;i++) {
        NAND_DATA = data[i];
    }
    EBI->CMD = EBI_CMD_ECCSTOP;
    // result in EBI->ECCPARITY;
    uint32_t chksum1 = EBI->ECCPARITY;
#if 1
    uint32_t chksum2 =  data[NAND_PAGESIZE+NAND_CHECKSUM_POS_0]
                      +(data[NAND_PAGESIZE+NAND_CHECKSUM_POS_1]<<8)
                      +(data[NAND_PAGESIZE+NAND_CHECKSUM_POS_2]<<16);

    if( chksum1 != chksum2 )
        return -2;
#endif
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_0] = chksum1&0xFF;
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_1] = (chksum1>>8)&0xFF;
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_2] = (chksum1>>16)&0xFF;

    for(uint16_t i=0;i<NAND_SPARESIZE;i++) {
        NAND_DATA = data[i];
    }

    return 0;
}

/*********************** Read Routines ****************************************/

/**
 *  @brief  Return signature of device
 */

int32_t  NAND_ReadSignature(uint8_t data[NAND_SIGNATURESIZE]) {
int32_t rc;

    EnableCE();
    SendCommand(CMD_READSIGNATURE,0);
    rc = NAND_WaitUntilReadyPin();

    CopyFromFlash(data,2);

    DisableCE();
    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadSpare
  *
  * @note    Read a 16 byte from NAND device
  */
int32_t NAND_ReadSpare(uint32_t pageaddr, uint8_t data[NAND_SPARESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READC,addr);

    rc = NAND_WaitUntilReadyPin();

    if( rc != 0 ) {
        CopyFromFlash(data,NAND_SPARESIZE);
    }

    DisableCE();
    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadPage
  *
  * @note    Read a page (512 bytes) from NAND device starting at a given
  *          page aligned address
  */
int32_t NAND_ReadPage(uint32_t pageaddr, uint8_t data[NAND_PAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READA,addr);
    rc = NAND_WaitUntilReadyPin();
    if( rc != 0 ) {
        CopyFromFlash(data,NAND_PAGESIZE);
    }

    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadFullPage
  *
  * @note    Read a page (528 bytes) from NAND device starting at a given
  *          page address
  */
int32_t NAND_ReadFullPage(uint32_t pageaddr, uint8_t data[NAND_FULLPAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READA,addr);
    rc = NAND_WaitUntilReadyPin();

    if( rc != 0 ) {
        CopyFromFlash(data,NAND_FULLPAGESIZE);
    }

    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadFullPage
  *
  * @note    Read a page (528 bytes) from NAND device starting at a given
  *          page address
  */
int32_t NAND_ReadFullPageECC(uint32_t pageaddr, uint8_t data[NAND_FULLPAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READA,addr);
    rc = NAND_WaitUntilReadyPin();

    uint32_t checksum1 = 0;
    if( rc != 0 ) {
        CopyFromFlashECC(data,NAND_FULLPAGESIZE,&checksum1);
    }

#if 1

    uint32_t checksum2 = 0;
    h2d_encode(data,&checksum2);

    // Verify
    if( checksum1 != checksum2 )
        return -2;

#endif
    DisableCE();

    // Get Checksum from read data
    uint32_t chksumread = data[NAND_PAGESIZE+NAND_CHECKSUM_POS_0]
                        +(data[NAND_PAGESIZE+NAND_CHECKSUM_POS_1]<<8)
                        +(data[NAND_PAGESIZE+NAND_CHECKSUM_POS_2]<<16);

    uint16_t pos = 0;
    uint8_t bit = 0;
    rc = h2d_verify( chksumread, checksum1, &pos, &bit);
    if( rc == 1 ) {
        data[pos] ^= (1<<bit);
    }
    //rc = NAND_Status();
    return rc;
}

/*********************** Write Routines ***************************************/

/**
  * @brief   NAND_WriteSpare
  *
  * @note    Write a 16 bytes onto NAND device
  */
int32_t NAND_WriteSpare(uint32_t pageaddr, uint8_t data[NAND_SPARESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();
    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_SPARESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_WritePage
  *
  * @note    Write a page (512 bytes) into NAND device starting at given page
  *          address
  */
int32_t NAND_WritePage(uint32_t pageaddr, uint8_t data[NAND_PAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }
    EnableCE();
    DisableWP();

    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_PAGESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_WriteFullPage
  *
  * @note    Write a full page (528 bytes) into NAND device starting at given
  *          address. The address must be aligned to a page address.
  *
  * @note    A confirm command is needed after a half page
  */
int32_t NAND_WriteFullPage(uint32_t pageaddr, uint8_t data[NAND_FULLPAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_FULLPAGESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_WriteFullPage
  *
  * @note    Write a full page (528 bytes) into NAND device starting at given
  *          address. The address must be aligned to a page address.
  *
  * @note    A confirm command is needed after a half page
  */
int32_t NAND_WriteFullPageECC(uint32_t pageaddr, uint8_t data[NAND_FULLPAGESIZE]) {
int32_t rc;
uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr);

