hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();
    uint32_t chksum = 0;
    h2d_encode(data, &chksum);
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_0] = chksum&0xFF;
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_1] = (chksum>>8)&0xFF;
    data[NAND_PAGESIZE+NAND_CHECKSUM_POS_2] = (chksum>>16)&0xFF;

    CopyToFlashECC(data, NAND_FULLPAGESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}


/*********************** Erase Routines ***************************************/

/**
  * @brief   NAND_EraseBlock
  *
  * @note    Erase a full block of 32 pages
  */
int32_t NAND_EraseBlock(uint32_t blockaddr) {
    int32_t rc;
    uint32_t addr = NAND_FULLADDR_FROM_PAGEADDR(blockaddr);

    if( !IsBlockAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_ERASEBLOCK,addr);
    rc = NAND_WaitUntilReadyPin();

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/*********************** Copy Back Routine ************************************/
/**
  * @brief   NAND_CopyBack
  *
  * @note    Copy the page at *pageaddr_src* to the page addressed by *pageaddr_dst*
  */
int32_t  NAND_CopyBack(uint32_t pageaddr_src, uint32_t pageaddr_dst) {
int32_t rc;
uint32_t srcaddr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr_src);
uint32_t dstaddr = NAND_FULLADDR_FROM_PAGEADDR(pageaddr_dst);

    if( ! (IsPageAddress(srcaddr)&&IsPageAddress(dstaddr)) ) {
        return -1;
    }

    // They must have the same value for the highest address bit
    if( ((srcaddr^dstaddr)&NAND_COPYREGIONMASK) != 0 ) {
        return -2;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_COPYBACK1, srcaddr);
    rc = NAND_WaitUntilReadyPin();

    SendCommand(CMD_COPYBACK2, dstaddr);
    rc = NAND_WaitUntilReadyPin();

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}
